<?xml version="1.0" encoding="UTF-8"?>
<lang>
	<translation lang="de">
		<string name="win-title">AutoHotkey &#8212; die beste Skript-Sprache f&#252;r Windows.</string>
		<string name="introduction">Einf&#252;hrung</string>
		<string name="version-history">Versionsgeschichte</string>
		<string name="usage-cases">Einsatzgebiete</string>
		<string name="script-structure">Aufbau eines Skripts</string>
		<string name="variables">Variablen</string>
		<string name="functions">Funktionen</string>
		<string name="commands">Befehle</string>
		<string name="functionality">Was alles m&#246;glich ist</string>
		<string name="gui">Benutzeroberfl&#228;chen</string>
		<string name="hotkeys">Tastenkombinationen</string>
		<string name="automation">Automatisierung</string>
		<string name="extensibility">Zugriff auf andere Techniken</string>
		<string name="programs">AHK - Programme</string>
		<string name="community">Community &amp; Foren</string>
		<string name="end">Ende</string>

		<string name="introduction/what">Was ist AutoHotkey?</string>
		<string name="introduction/cite">&#187;AutoHotkey ist eine freie Open-Source-Scriptsprache f&#252;r Windows.&#171;&#10;&#9;&#9;&#9;&#9;&#9;&#9;&#8212; de.autohotkey.com</string>
		<string name="introduction/advantages">Was sind die Vorteile von AutoHotkey?</string>
		<string name="introduction/simplicity">&#8226; Einfachheit</string>
		<string name="introduction/simplicity/text">AutoHotkey ist relativ einfach zu erlernen, auch und besonders f&#252;r Programmier-Anf&#228;nger. Skripts f&#252;r die t&#228;gliche Arbeit am Computer lassen sich in kurzer Zeit erstellen. Zudem ist AutoHotkey eine eher &quot;laxe&quot; Sprache.</string>
		<string name="introduction/builtins">&#8226; Eingebautes</string>
		<string name="introduction/builtins/text">AutoHotkey hat zahlreiche n&#252;tzliche Funktionen fertig integriert. W&#228;hrend es in anderen Sprachen beispielsweise recht kompliziert sein, ein UI zu erstellen, l&#228;sst sich dies in AutoHotkey mit wenigen Befehlen erledigen. </string>
		<string name="introduction/hotkeys">&#8226; Tastenkombinationen</string>
		<string name="introduction/hotkeys/text">Tastenkombinationen, sogenannte &quot;hotkeys&quot;, sind, wie schon der Name verr&#228;t, ein besonderer Schwerpunkt in AutoHotkey. Sie lassen sich mit nur einer Codezeile erstellen. Dank dieser Funktionalit&#228;t wird AutoHotkey auch oft zur Automatisierung von Computerspielen verwendet.</string>
		<string name="introduction/automation">&#8226; Automatisierung</string>
		<string name="introduction/automation/text">Der andere Schwerpunkt von AutoHotkey ist die Automatisierung. Es gibt eine Unzahl an Befehlen zur Automatisierung von Fenstern, es lassen sich Tasten an Programme senden, Aktionen k&#246;nnen in bestimmten Zeitintervallen ausgef&#252;hrt werden usw.&#10;Dies l&#228;sst sich nicht nur in Spielen einsetzen, auch allt&#228;gliche Computerarbeit (z.B. im B&#252;ro) l&#228;sst sich vielfach erleichtern.</string>
		<string name="introduction/advanced">&#8226; Fortgeschrittenes</string>
		<string name="introduction/advanced/text">Neben den leicht zug&#228;nglichen Befehlen f&#252;r einfachere Skripte bieten besonders neuere Versionen von AutoHotkey auch die M&#246;glichkeit von Zugriffen auf fortgeschrittene Techniken. So ist es beispielsweise m&#246;glich, &#252;ber das Internet zu kommunizieren, in das Betriebssystem einzugreifen, Office-Programme zu automatisieren oder in anderen Sprachen programmierten Code auszuf&#252;hren.</string>

		<string name="script-structure/file">Eine Skript-Datei</string>
		<string name="script-structure/file/text">Ein AutoHotkey-Script ist einfach nur eine ganz normale Text-Datei. Meistens wird die Dateiendung &quot;.ahk&quot; benutzt.</string>
		<string name="script-structure/auto-execute">Wo fangen wir an? &#8212; die &quot;auto-execute section&quot;</string>
		<string name="script-structure/auto-execute/text">Wird ein Skript gestartet, wird zuerst die sogenannte &quot;auto-execute section&quot; ausgef&#252;hrt. Sie beginnt in der ersten Zeile der Datei und endet entweder am Ende der Datei oder beim ersten &quot;return&quot;-Befehl, was immer zuerst kommt.</string>

		<string name="script-structure/variables">Variablen</string>
		<string name="script-structure/variables/text">Variablen lassen sich schnell und einfach nutzen. Anders als in Javascript müssen Variablen nicht einmal deklariert werden (kein &quot;var&quot; o. &#196;. vor dem Namen) - sie enthalten dann standardmäßig einen leeren String.&#10;&#10;Zuweisen lassen sich Werte mit &quot;:=&quot; :</string>

		<string name="script-structure/functions">Funktionen</string>
		<string name="script-structure/functions/text">Wie in Javascript gibt es in AutoHotkey auch Funktionen. Die Syntax zum Aufrufen ist exakt dieselbe:</string>
		<string name="script-structure/functions/UDF">Benutzerdefinierte Funktionen</string>
		<string name="script-structure/functions/UDF/text">Die Syntax ist fast dieselbe wie in Javascript, nur das Wort &quot;function&quot;, das in Javascript vor jede Funktion kommt, wird nicht verwendet:</string>

		<string name="script-structure/commands">Befehle</string>
		<string name="script-structure/commands/text">Anders als in den meisten anderen Sprachen gibt es neben Funktionen in AutoHotkey noch &quot;Befehle&quot;. Diese tun praktisch dasselbe wie Funktionen, haben aber ein paar entscheidende Unterschiede, die leicht zu Verwirrung führen k&#246;nnen.&#10;&#10;In AutoHotkey v2 sind Befehle deshalb identisch mit Funktionen.</string>
		<string name="script-structure/commands/differences">Unterschiede</string>
		<string name="script-structure/commands/differences/text">&#8226; Syntax: es werden keine Klammern verwendet&#10;&#8226; Variablen werden anders dargestellt&#10;&#8226; Benutzerdefinierte Befehle sind nicht möglich.</string>

		<string name="exit">Beenden</string>
		<string name="reload">Neu starten</string>
		<string name="execute">Ausf&#252;hren</string>
		<string name="undo">R&#252;ckg&#228;ngig</string>
		<string name="redo">Wiederholen</string>
	</translation>
</lang>